Documents/ПеремещениеМалоценкиВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПеремещениеМалоценкиВЭксплуатации</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.ПередачаМалоценкиВЭксплуатацию</xr:Item>
				<xr:Item>Document.ПеремещениеМалоценкиВЭксплуатации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииМалоценкиВЭксплуатации</xr:Item>
				<xr:Item>InformationRegister.СписаннаяМалоценкаВЭксплуатации</xr:Item>
				<xr:Item>AccumulationRegister.МалоценкаВЭксплуатации</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПартию</Name>
					<Comment>Если истина, то пользователь должен указывать партию малоценки в эксплуатации.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицоКуда</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерезКого</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпускРазрешил</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторойЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТретийЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СводныеПеремещения</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеМалоценкиВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилЛицоОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МалоценныеАктивы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеИспользования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НазначенияИспользования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПартияМалоценкиВЭксплуатации</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ПартияМалоценкиВЭксплуатации</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаМалоценкиВЭксплуатацию</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковМалоценкиВЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеИспользованияНовое</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НазначенияИспользования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговоеНазначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбособленныеПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПеремещениеМалоценкиВЭксплуатации/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;

// Хранит вид малоценки МБП
Перем мМБП Экспорт;

Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Функция формирует табличный документ с типовой печатной формой ОЗ-1
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОЗ1()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка"           , Ссылка);
	Запрос.УстановитьПараметр("НаДату"           , МоментВремени());
	Запрос.УстановитьПараметр("Организация"      , Организация);
	Запрос.УстановитьПараметр("Получил"          , ФизЛицоКуда);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер" , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Дата                           КАК ДатаАкта,
	|	Док.Номер                          КАК НомерАкта,
	|	Док.Организация.НаименованиеПолное КАК Организация,
	|	Док.ПодразделениеОрганизации       КАК ПринялоПодразделение,
	|	Док.ПодразделениеОрганизации       КАК СдалоПодразделение,
	|	КодыОрганизации.КодПоЕДРПОУ        КАК ЕДРПОУ,
	|	ФИОПолучил.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОПолучил.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОПолучил.Отчество, 1, 1) + "".""          КАК ПолучилФИО,
	|	ПРЕДСТАВЛЕНИЕ(РаботникиОрганизаций.Должность)               КАК ПолучилДолжность,
	|	ФИОГлавныйБухгалтер.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер
	|ИЗ
	|	Документ.ПеремещениеМалоценкиВЭксплуатации КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыОрганизации.СрезПоследних(&НаДату,
	|		                                 Организация = &Организация) КАК КодыОрганизации
	|		ПО Док.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &Получил) КАК ФИОПолучил
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|		                    &НаДату,
	|		                    Сотрудник.ФизЛицо = &Получил
	|		                    	И Организация = &Организация) КАК РаботникиОрганизаций
	|		ПО Док.ПодразделениеОрганизации = РаботникиОрганизаций.ПодразделениеОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|		                    &НаДату,
	|		                    ФизЛицо В
	|		                        (ВЫБРАТЬ
	|		                            ОтветственныеЛица.ФизическоеЛицо
	|		                        ИЗ
	|		                            РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|		                                            &НаДату,
	|		                                            СтруктурнаяЕдиница = &Организация
	|		                                            И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
	|		                    ) КАК ФИОГлавныйБухгалтер
	|		ПО (ИСТИНА)
	|ГДЕ 
	|	Док.Ссылка = &Ссылка
	|	";
	ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
	ВыборкаПоШапке.Следующий();

													
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка"         , Ссылка);
	Запрос.УстановитьПараметр("НаДату"         , Дата);
	Запрос.УстановитьПараметр("МоментДокумента", МоментВремени());
	Запрос.УстановитьПараметр("Организация"    , Организация);
	Запрос.УстановитьПараметр("Подразделение"  , ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("СчетМЦ"         , ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации);
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначенияИспользования);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПартииМалоценкиВЭксплуатации);
	Запрос.УстановитьПараметр("Субконто", МассивСубконто);
	
	ВидыМалоценки = Новый Массив;
	ВидыМалоценки.Добавить(Перечисления.ВидыМалоценки.МалоценныйНеоборотныйАктив);
	ВидыМалоценки.Добавить(Перечисления.ВидыМалоценки.БиблиотечныеФонды);
	Запрос.УстановитьПараметр("ВидМалоценки", ВидыМалоценки);
	
	СписокРаботников = МалоценныеАктивы.ВыгрузитьКолонку("ФизЛицо");
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(СписокРаботников);
	Запрос.УстановитьПараметр("СписокРаботников", СписокРаботников);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.ФизЛицо.Код                                     КАК КодМОЛа,
	|	ФИООтпустил.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИООтпустил.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИООтпустил.Отчество, 1, 1) + ""."" КАК СдалФИО,
	|	ПРЕДСТАВЛЕНИЕ(РаботникиОрганизаций.Должность)       КАК СдалДолжность,
	|	Док.НазначениеИспользования.СчетБУДляПечати         КАК СчетДт,
	|	Док.НазначениеИспользования.СчетБУДляПечати         КАК СчетКт,
	|	Док.Номенклатура.НаименованиеПолное                 КАК НаименованиеОС" + ?(Проведен, ",
	|	Хозрасчетный.СубконтоКт3.Дата                       КАК ДатаВвода,
	|	ВЫБОР
	|		КОГДА Хозрасчетный.КоличествоОборотКт = 0
	|			ТОГДА Хозрасчетный.СуммаОборот
	|		ИНАЧЕ Хозрасчетный.СуммаОборот / Хозрасчетный.КоличествоОборотКт
	|	КОНЕЦ                                              КАК ПервоначальнаяСтоимость", "") + "
	|ИЗ
	|	Документ.ПеремещениеМалоценкиВЭксплуатации.МалоценныеАктивы КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо В (&СписокРаботников)) КАК ФИООтпустил
	|		ПО Док.ФизЛицо = ФИООтпустил.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|		                    &НаДату,
	|		                    Сотрудник.ФизЛицо В (&СписокРаботников)
	|		                    	И Организация = &Организация) КАК РаботникиОрганизаций
	|		ПО Док.ФизЛицо = РаботникиОрганизаций.Сотрудник.Физлицо
	|			И (РаботникиОрганизаций.ПодразделениеОрганизации = &Подразделение)" + ?(Проведен, "
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			                   &МоментДокумента,
	|			                   &МоментДокумента, , , ,
	|			                   СчетКт = &СчетМЦ,
	|			                   &Субконто, ) КАК Хозрасчетный
	|		ПО Док.ФизЛицо = Хозрасчетный.СубконтоКт1
	|			И Док.НазначениеИспользования = Хозрасчетный.СубконтоКт2", "") + "
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|	И Док.НазначениеИспользования.ВидМалоценки В(&ВидМалоценки)";
		
	
	Результат = Запрос.Выполнить();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВводВЭксплуатациюОС_ОЗ1";
	Макет = ПолучитьОбщийМакет("ОЗ1");
	
    ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Если Результат.Пустой() Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
		ТабДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
	ВыборкаПоКомиссии = РаботаСДиалогами.ПолучитьСведенияОКомиссии(ЭтотОбъект);
	ВыборкаПоОС = Результат.Выбрать();
	
	Пока ВыборкаПоОС.Следующий() Цикл

		ОбластьМакета = Макет.ПолучитьОбласть("ОЗ1");
		Параметры     = ОбластьМакета.Параметры;
		Параметры.Заполнить(ВыборкаПоШапке);
		Параметры.Заполнить(ВыборкаПоКомиссии);
		Параметры.Заполнить(ВыборкаПоОС);
		Параметры.ВидОперации = "Переміщення";
		Параметры.Валюта      = ВалютаРегламентированногоУчета;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;

	ТабДокумент.ОбластьПечати = ТабДокумент.Область(2, 2, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы);
	Возврат ТабДокумент;

КонецФункции // ПечатьОЗ1()

// Функция формирует печатную форму М-11
//
Функция ПечатьМ11()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент"  , Ссылка);
	Запрос.УстановитьПараметр("НаДату"           , Дата);
	Запрос.УстановитьПараметр("Организация"      , Организация);
	Запрос.УстановитьПараметр("ЧерезКого"        , ЧерезКого);
	Запрос.УстановитьПараметр("ОтпускРазрешил"   , ОтпускРазрешил);
	Запрос.УстановитьПараметр("Получил"          , ФизЛицоКуда);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер" , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Номер                                                   КАК НомерДокумента,
	|	Док.Дата                                                    КАК ДатаДокумента,
	|	Док.Организация                                             КАК Организация,
	|	Док.Организация.НаименованиеПолное                          КАК ПредставлениеОрганизации,
	|	ПРЕДСТАВЛЕНИЕ(Док.ПодразделениеОрганизации)                 КАК Подразделение,
	|	Док.Основание                                               КАК Основание,
	|	КодыОрганизации.КодПоЕДРПОУ                                 КАК КодПоЕДРПОУ,
	|	ФИОЧерезКого.Фамилия + "" ""
	|		+ ФИОЧерезКого.Имя + "" ""
	|		+ ФИОЧерезКого.Отчество                                 КАК ЧерезКого,
	|	ФИОЧерезКого.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОЧерезКого.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОЧерезКого.Отчество, 1, 1) + "".""        КАК ЧерезКогоФИО,
	|	ФИООтпускРазрешил.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИООтпускРазрешил.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИООтпускРазрешил.Отчество, 1, 1) + "".""   КАК ОтпускРазрешил,
	|	ФИОКому.Фамилия + "" ""
	|		+ ФИОКому.Имя + "" ""
	|		+ ФИОКому.Отчество                                              КАК Кому,
	|	ФИОКому.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОКому.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОКому.Отчество, 1, 1) + "".""                     КАК КомуФИО,
	|	ФИОГлавныйБухгалтер.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер
	|ИЗ
	|	Документ.ПеремещениеМалоценкиВЭксплуатации КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.КодыОрганизации.СрезПоследних(
	|			                &НаДату,
	|			                Организация = &Организация) КАК КодыОрганизации
	|		ПО Док.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &ЧерезКого) КАК ФИОЧерезКого
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &ОтпускРазрешил) КАК ФИООтпускРазрешил
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &Получил) КАК ФИОКому
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|		                    &НаДату,
	|		                    ФизЛицо В
	|		                        (ВЫБРАТЬ
	|		                            ОтветственныеЛица.ФизическоеЛицо
	|		                        ИЗ
	|		                            РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|		                                            &НаДату,
	|		                                            СтруктурнаяЕдиница = &Организация
	|		                                            И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
	|		                    ) КАК ФИОГлавныйБухгалтер
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Док.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	                            
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("НаДату"         , Дата);
	Запрос.УстановитьПараметр("ВидМалоценки"   , Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет);
	
	СписокРаботников = МалоценныеАктивы.ВыгрузитьКолонку("ФизЛицо");
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(СписокРаботников);
	Запрос.УстановитьПараметр("СписокРаботников", СписокРаботников);
	
	Если Проведен Тогда
		
		Запрос.УстановитьПараметр("МоментДокумента", МоментВремени());
		Запрос.УстановитьПараметр("СчетМЦ"         , ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации);
		
		МассивСубконто = Новый Массив;
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций);
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначенияИспользования);
		Запрос.УстановитьПараметр("Субконто", МассивСубконто);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ФИООтпустил.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИООтпустил.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИООтпустил.Отчество, 1, 1) + "".""                 КАК Отпустил,
		|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное                     КАК МатериалНаименование,
		|	ВложенныйЗапрос.Номенклатура.Код                                    КАК НоменклатурныйНомер,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
		|	ВложенныйЗапрос.Номенклатура.БазоваяЕдиницаИзмерения.Код            КАК ЕдиницаИзмеренияКод,
		|	ВложенныйЗапрос.СчетПередачиБУ                                      КАК СчетПередачи,
		|	ВложенныйЗапрос.Количество                                          КАК Количество,
		|	ВложенныйЗапрос.Цена                                                КАК Цена,
		|	ВложенныйЗапрос.Стоимость                                           КАК Стоимость
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоКт1 КАК Справочник.ФизическиеЛица)                          КАК Сдал,
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоКт2 КАК Справочник.НазначенияИспользования).Владелец        КАК Номенклатура,
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоКт2 КАК Справочник.НазначенияИспользования).СчетБУДляПечати КАК СчетПередачиБУ,
		|		СУММА(Хозрасчетный.КоличествоОборотКт)                                                    КАК Количество,
		|		ВЫБОР
		|			КОГДА Хозрасчетный.КоличествоОборотКт = 0
		|				ТОГДА Хозрасчетный.СуммаОборот
		|			ИНАЧЕ ВЫРАЗИТЬ(Хозрасчетный.СуммаОборот / Хозрасчетный.КоличествоОборотКт КАК ЧИСЛО(15, 2))
		|		КОНЕЦ КАК Цена,
		|		СУММА(Хозрасчетный.СуммаОборот) КАК Стоимость
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		|		                   &МоментДокумента,
		|		                   &МоментДокумента, , , ,
		|		                   СчетКт = &СчетМЦ,
		|		                   &Субконто, ) КАК Хозрасчетный
		|	ГДЕ
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоКт2 КАК Справочник.НазначенияИспользования).ВидМалоценки = &ВидМалоценки
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоКт1 КАК Справочник.ФизическиеЛица),
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоКт2 КАК Справочник.НазначенияИспользования).Владелец,
		|		ВЫРАЗИТЬ(Хозрасчетный.СубконтоКт2 КАК Справочник.НазначенияИспользования).СчетБУДляПечати,
		|		ВЫБОР
		|			КОГДА Хозрасчетный.КоличествоОборотКт = 0
		|				ТОГДА Хозрасчетный.СуммаОборот
		|			ИНАЧЕ ВЫРАЗИТЬ(Хозрасчетный.СуммаОборот / Хозрасчетный.КоличествоОборотКт КАК ЧИСЛО(15, 2))
		|		КОНЕЦ) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			                &НаДату,
		|			                ФизЛицо В (&СписокРаботников)) КАК ФИООтпустил
		|		ПО ВложенныйЗапрос.Сдал = ФИООтпустил.ФизЛицо
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Стоимость)
		|ПО
		|	Сдал";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФИООтпустил.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИООтпустил.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИООтпустил.Отчество, 1, 1) + "".""                 КАК Отпустил,
		|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное                     КАК МатериалНаименование,
		|	ВложенныйЗапрос.Номенклатура.Код                                    КАК НоменклатурныйНомер,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
		|	ВложенныйЗапрос.Номенклатура.БазоваяЕдиницаИзмерения.Код            КАК ЕдиницаИзмеренияКод,
		|	ВложенныйЗапрос.СчетПередачиБУ                                      КАК СчетПередачи,
		|	ВложенныйЗапрос.Количество                                          КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		Док.ФизЛицо                                 КАК Сдал,
		|		Док.Номенклатура                            КАК Номенклатура,
		|		Док.НазначениеИспользования.СчетБУДляПечати КАК СчетПередачиБУ,
		|		СУММА(Док.Количество)                       КАК Количество
		|	ИЗ
		|		Документ.ПеремещениеМалоценкиВЭксплуатации.МалоценныеАктивы КАК Док
		|	ГДЕ
		|		Док.Ссылка = &ТекущийДокумент
		|		И Док.НазначениеИспользования.ВидМалоценки = &ВидМалоценки
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Док.ФизЛицо,
		|		Док.Номенклатура,
		|		Док.НазначениеИспользования.СчетБУДляПечати) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			                &НаДату,
		|			                ФизЛицо В (&СписокРаботников)) КАК ФИООтпустил
		|		ПО ВложенныйЗапрос.Сдал = ФИООтпустил.ФизЛицо
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Сдал";
		
	КонецЕсли;

	ЗапросПоНоменклатуре = Запрос.Выполнить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеМалоценкиВЭксплуатации_М11";
	
	Макет = ПолучитьОбщийМакет("М11");
	
	Если ЗапросПоНоменклатуре.Пустой() Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
		ТабДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
	ВыборкаКому   = ЗапросПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НеПервый      = Ложь;
	ЕстьЧерезКого = ЗначениеЗаполнено(ЧерезКого);
	ОбластьНомера = Макет.ПолучитьОбласть("Номера");
	
	Пока ВыборкаКому.Следующий()Цикл
		
		Если НеПервый Тогда
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		НеПервый = Истина;
		
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Заполнить(Шапка);
		Область.Параметры.КодОперации = "Переміщення";	
		Область.Параметры.Валюта      = мВалютаРегламентированногоУчета;
		
		ТабДокумент.Вывести(Область);
		ТабДокумент.Вывести(ОбластьНомера);
		
		ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
		ПараметрыПодвал = ОбластьПодвал.Параметры;
		ПараметрыПодвал.Заполнить(Шапка);
		
		Если Проведен Тогда
			
			ПрописьВалюты = мВалютаРегламентированногоУчета.ПараметрыПрописиНаУкраинском;
			ПараметрыПодвал.ИтогоСуммаПрописью = ЧислоПрописью(ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаКому.Стоимость),
			"Л=uk_UA;ДП=Истина;", ПрописьВалюты);
			
		КонецЕсли;
		
		ВыборкаПоСтрокам = ВыборкаКому.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		КоличествоВВыборке     = ВыборкаПоСтрокам.Количество();
		КоличествоОбработанных = 1;
		// В форме сказано "Кількість найменувань". Будет выводится количество позиций.
		ПараметрыПодвал.ИтогоКоличествоПрописью = ЧислоПрописью(КоличествоВВыборке, 
		"Л=uk_UA;НП=Ложь;НД=Ложь;", ",,,,,,,,0");
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(ВыборкаПоСтрокам);
			
			Если КоличествоОбработанных = КоличествоВВыборке Тогда
				// Последняя запись. Ее не следует отрывать от подписей.
				
				МассивТаблиц = Новый Массив(2);
				МассивТаблиц[0] = Область;
				МассивТаблиц[1] = ОбластьПодвал;
				
				Если НЕ ТабДокумент.ПроверитьВывод(МассивТаблиц) Тогда
					
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабДокумент.Вывести(ОбластьНомера);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ТабДокумент.Вывести(Область);
			КоличествоОбработанных = КоличествоОбработанных + 1;
			Отпустил               = ВыборкаПоСтрокам.Отпустил;
			
		КонецЦикла;
		
		ПараметрыПодвал.Получил  = ?(ЕстьЧерезКого, Шапка.ЧерезКогоФИО, Шапка.КомуФИО);
		ПараметрыПодвал.Отпустил = Отпустил;
		
		ТабДокумент.Вывести(ОбластьПодвал);
	
	КонецЦикла;
	
	ТабДокумент.ОбластьПечати = ТабДокумент.Область("C2:C" + ТабДокумент.ШиринаТаблицы);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьМ11()

// Функция формирует печатную форму документа
//
Функция ПечатьМШ7(Сдача)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент"  , Ссылка);
	Запрос.УстановитьПараметр("НаДату"           , Дата);
	Запрос.УстановитьПараметр("Организация"      , Организация);
	Запрос.УстановитьПараметр("МОЛ"              , ЧерезКого);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер" , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Номер                                                   КАК НомерДокумента,
	|	Док.Дата                                                    КАК ДатаДокумента,
	|	Док.Организация                                             КАК Организация,
	|	Док.Организация.НаименованиеПолное                          КАК ПредставлениеОрганизации,
	|	ПРЕДСТАВЛЕНИЕ(Док.ПодразделениеОрганизации)                 КАК Подразделение,
	|	КодыОрганизации.КодПоЕДРПОУ                                 КАК КодПоЕДРПОУ,
	|	ФИОМОЛ.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОМОЛ.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОМОЛ.Отчество, 1, 1) + "".""              КАК МОЛ,
	|	ФИОГлавныйБухгалтер.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер
	|ИЗ
	|	Документ.ПеремещениеМалоценкиВЭксплуатации КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.КодыОрганизации.СрезПоследних(
	|			                &НаДату,
	|			                Организация = &Организация) КАК КодыОрганизации
	|		ПО Док.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &МОЛ) КАК ФИОМОЛ
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|		                    &НаДату,
	|		                    ФизЛицо В
	|		                        (ВЫБРАТЬ
	|		                            ОтветственныеЛица.ФизическоеЛицо
	|		                        ИЗ
	|		                            РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|		                                            &НаДату,
	|		                                            СтруктурнаяЕдиница = &Организация
	|		                                И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
	|		                    ) КАК ФИОГлавныйБухгалтер
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Док.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
  	Запрос.УстановитьПараметр("ВидМалоценки"   , Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура.Код                                    КАК НоменклатурныйНомер,
	|	Док.Номенклатура.НаименованиеПолное                     КАК МатериалНаименование,
	|	ПРЕДСТАВЛЕНИЕ(Док.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
	|	Док.Номенклатура.БазоваяЕдиницаИзмерения.Код            КАК ЕдиницаИзмеренияКод,
	|	Док.Количество                                          КАК Количество,
	|	Док.ФизЛицо                                             КАК Сотрудник,
	|	Док.ДатаДокумента                                       КАК ДатаДокумента,
	|	Док.СрокСлужбы                                          КАК СрокСлужбы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Док.Номенклатура                           КАК Номенклатура,
	|		СУММА(Док.Количество)                      КАК Количество,
	|		МИНИМУМ(Док.НомерСтроки) 		           КАК НомерСтроки,
	|		Док.Ссылка.Дата                            КАК ДатаДокумента," + ?(Сдача, "
	|		Док.ФизЛицо                                КАК ФизЛицо,
	|		Док.НазначениеИспользования.СрокПолезногоИспользования КАК СрокСлужбы", "
	|		Док.Ссылка.ФизЛицоКуда                                 КАК ФизЛицо,
	|		Док.НазначениеИспользованияНовое.СрокПолезногоИспользования КАК СрокСлужбы") + "
	|	ИЗ
	|		Документ.ПеремещениеМалоценкиВЭксплуатации.МалоценныеАктивы КАК Док
	|	ГДЕ
	|		Док.Ссылка = &ТекущийДокумент
	|		И Док.НазначениеИспользования.ВидМалоценки = &ВидМалоценки
	|
	|	СГРУППИРОВАТЬ ПО
	|		Док.Номенклатура,
	|		Док.Ссылка.Дата," + ?(Сдача, "
	|		Док.ФизЛицо,
	|		Док.НазначениеИспользования.СрокПолезногоИспользования", "
	|		Док.Ссылка.ФизЛицоКуда,
	|		Док.НазначениеИспользованияНовое.СрокПолезногоИспользования") + "
	|	) КАК Док
	|
	|УПОРЯДОЧИТЬ ПО НомерСтроки ВОЗР";

	ЗапросПоНоменклатуре = Запрос.Выполнить();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеМалоценкиВЭксплуатации_МШ7";
	
	// Вывод заголовка
	Макет = ПолучитьОбщийМакет("МШ7");
	
	Если ЗапросПоНоменклатуре.Пустой() Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
		ТабДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заполнить(Шапка);
	Область.Параметры.КодОперации = ?(Сдача, "Переміщення (сдача)", "Переміщення (видача)");	
	
	ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(Шапка);
	
	ТабДокумент.Вывести(Область);

	ВысотаШапки   = ТабДокумент.ВысотаТаблицы;
	ШиринаТаблицы = ТабДокумент.ШиринаТаблицы;
	ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область("R" + ВысотаШапки);
	ТабДокумент.ОбластьПечати            = ТабДокумент.Область("C2:C" + ШиринаТаблицы);
	
	ВыборкаПоСтрокам = ЗапросПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КоличествоВВыборке     = ВыборкаПоСтрокам.Количество();
	КоличествоОбработанных = 1;
	
	СписокФизическихЛиц = Новый Массив;
	Пока ВыборкаПоСтрокам.Следующий() Цикл
		СписокФизическихЛиц.Добавить(ВыборкаПоСтрокам.Сотрудник);
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(СписокФизическихЛиц) Тогда
		ДанныеФизЛица = ОбщегоНазначения.ДанныеСотрудников(Организация, СписокФизическихЛиц, Дата);
	КонецЕсли;
		
	ВыборкаПоСтрокам.Сбросить();

	Пока ВыборкаПоСтрокам.Следующий() Цикл

		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(ВыборкаПоСтрокам);
		Область.Параметры.ТабельныйНомер		= "";
		Если ДанныеФизЛица <> Неопределено Тогда
			СтрокаТЗ = ДанныеФизЛица.Найти(ВыборкаПоСтрокам.Сотрудник, "ФизЛицо");
		КонецЕсли;
			
		Если СтрокаТЗ <> Неопределено Тогда
			Область.Параметры.ТабельныйНомер	= СтрокаТЗ.ТабельныйНомер;
		Иначе
		Сообщить(НСтр("ru='Проверьте корректность ввода данных. Не является сотрудником организации - ';uk='Перевірте коректність введення даних. Не є співробітником організації - '") 
							+ ВыборкаПоСтрокам.Сотрудник + "!", СтатусСообщения.Информация);
		КонецЕсли;

		Область.Параметры.НомерПП = КоличествоОбработанных;
		
		Если КоличествоОбработанных = КоличествоВВыборке Тогда
			// Последняя запись. Ее не следует отрывать от подписей.
			
			МассивТаблиц = Новый Массив(2);
			МассивТаблиц[0] = Область;
			МассивТаблиц[1] = ОбластьПодвал;
			
			Если НЕ ТабДокумент.ПроверитьВывод(МассивТаблиц) Тогда
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТабДокумент.Вывести(Область);
        КоличествоОбработанных = КоличествоОбработанных + 1;

	КонецЦикла;

	// Вывод подвала
	ТабДокумент.Вывести(ОбластьПодвал);

	Возврат ТабДокумент;

КонецФункции // ПечатьМШ7()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "МШ7с" Тогда
		
		ТабДокумент = ПечатьМШ7(Истина);
		
	ИначеЕсли ИмяМакета = "МШ7в" Тогда
		
		ТабДокумент = ПечатьМШ7(Ложь);
		
	ИначеЕсли ИмяМакета = "М11" Тогда
		
		ТабДокумент = ПечатьМ11();
		
	ИначеЕсли ИмяМакета = "ОЗ1" Тогда
		
		ТабДокумент = ПечатьОЗ1();
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(Ссылка), Ссылка);
	
КонецПроцедуры // Печать()

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("МШ7с, МШ7в, М11, ОЗ1",
	                         НСтр("ru='Ведомость МШ-7 (сдача)';uk='Відомість МШ-7 (здача)'"),
	                         НСтр("ru='Ведомость МШ-7 (выдача)';uk='Відомість МШ-7 (видача)'"),
							 "Накладная M-11",
							 НСтр("ru='Форма ОЗ-1';uk='Форма ОЗ-1'"));

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , Ложь);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , Ложь);
	
	Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Нал");
	
	Если НЕ Отказ Тогда
		
		СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , мУчетнаяПолитикаНУ.СхемаНалогообложения.НалогНаПрибыль = Истина);
		СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , мУчетнаяПолитикаНУ.СхемаНалогообложения.НДС            = Истина);
		
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

// Процедура проверяет правильность заполнения реквизитов документа
//
Функция ПроверкаРеквизитов(Отказ, Заголовок) Экспорт

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	СтруктураШапкиДокумента.Вставить("КодОперации", "Перемещение");

	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);	
	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);

	РеквизитыШапки = "ФизЛицоКуда";
	
	Если ОтражатьВУправленческомУчете Тогда
		РеквизитыШапки = РеквизитыШапки + ", Подразделение";
	КонецЕсли;	
	
	РеквизитыШапки = РеквизитыШапки + ", Организация";
	
	//Если ОтражатьВБухгалтерскомУчете Тогда
	//	РеквизитыШапки = РеквизитыШапки + ", ПодразделениеОрганизации";
	//КонецЕсли;	

	РеквизитыТЧ = "Номенклатура, НазначениеИспользования, Количество, ФизЛицо";         
	
	Если СтруктураШапкиДокумента.УказыватьПартию Тогда
		
		РеквизитыТЧ = РеквизитыТЧ + ", ПартияМалоценкиВЭксплуатации";
		
	КонецЕсли;

	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, Новый Структура(РеквизитыШапки), Отказ, Заголовок);
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "МалоценныеАктивы", Новый Структура(РеквизитыТЧ), Отказ, Заголовок);
	
	Возврат СтруктураШапкиДокумента;

КонецФункции // ПроверкаРеквизитов()

// Проверяет правильность выбора назначений использования, выбранных
// в табличной части.
//
Процедура ПроверитьНазначенияИспользования(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок)
	
	Для каждого СтрокаТЧ Из ТаблицаПоМалоценке Цикл
	
		СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Строка номер ""%1"" табличной части ""малоценные активы"": ';uk='Рядок номер ""%1"" табличної частини ""малоцінні активи"": '"), СокрЛП(СтрокаТЧ.НомерСтроки)) + Символы.ПС;
										
		Если СтрокаТЧ.Номенклатура <> СтрокаТЧ.ВладелецНазначения Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
			                 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Назначение использования <%1> не соответствует номенклатуре <%2>.';uk='Призначення використання <%1> не відповідає номенклатурі <%2>.'"), СтрокаТЧ.НазначениеИспользования, СтрокаТЧ.Номенклатура),
							 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
			
		КонецЕсли;
										
		Если СтрокаТЧ.Номенклатура <> СтрокаТЧ.ВладелецНазначенияНового Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
			                 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Новое назначение использования <%1> не соответствует номенклатуре <%2>.';uk='Нове призначення використання <%1> не відповідає номенклатурі <%2>.'"), СтрокаТЧ.НазначениеИспользованияНовое, СтрокаТЧ.Номенклатура),
							 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СпособОтраженияРасходов) Тогда
				
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
							 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В назначении использования <%1> не выбран ""Способ отражения расходов"".';uk='В призначенні використання <%1> не обраний ""Спосіб відображення витрат"".'"), СтрокаТЧ.НазначениеИспользования),
							 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СпособОтраженияРасходовНовый) Тогда
				
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
							 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В новом назначении использования <%1> не выбран ""Способ отражения расходов"".';uk='У новому призначенні використання <%1> не обраний ""Спосіб відображення витрат"".'"), СтрокаТЧ.НазначениеИспользованияНовое),
							 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ВидМалоценки) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
			                 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В назначении использования <%1> не выбран ""Вид малоценки"".';uk='В призначенні використання <%1> не обраний "" Вид малоцінних активів"".'"), СтрокаТЧ.НазначениеИспользования),
			                 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ВидМалоценкиНовый) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
			                 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В новом назначении использования <%1> не выбран ""Вид малоценки"".';uk='У новому призначенні використання <%1> не обраний ""Вид малоцінки"".'"), СтрокаТЧ.НазначениеИспользования),
			                 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
			
		Иначе
			
											
				Если СтрокаТЧ.ВидМалоценки <> СтрокаТЧ.ВидМалоценкиНовый Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.ПС + Символы.Таб
					                 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Вид малоценки нового назначения использования <%1> не соответствует виду малоценки старого назначения использования <%2>.';uk='Вид малоцінних активів нового призначення використання <%1> не відповідає виду малоцінних активів старого призначення використання <%2>.'"), СтрокаТЧ.ВидМалоценкиНовый, СтрокаТЧ.ВидМалоценки),
									 Отказ, Заголовок);
				СтрокаНачалаСообщенияОбОшибке = "";
					
				КонецЕсли;
			
			
		КонецЕсли;
		
		Если ОтражатьВБухгалтерскомУчете Тогда
		
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СчетПередачиБУ) Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
				                 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В назначении использования <%1> не выбран ""Счет передачи"".';uk='В призначенні використання <%1> не обраний ""Рахунок передачі"".'"), СтрокаТЧ.НазначениеИспользования),
				                 Отказ, Заголовок);
				СтрокаНачалаСообщенияОбОшибке = "";
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СчетПередачиБУНовый) Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
				                 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В новом назначении использования <%1> не выбран ""Счет передачи"".';uk='У новому призначенні використання <%1> не обраний ""Рахунок передачі"".'"), СтрокаТЧ.НазначениеИспользованияНовое),
				                 Отказ, Заголовок);
				СтрокаНачалаСообщенияОбОшибке = "";
				
			КонецЕсли;
			
			Если (СтрокаТЧ.ВидМалоценки <> мМБП) Тогда
				
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СчетАмортизацииБУ) Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
					                 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В назначении использования <%1> не выбран ""Счет амортизации"".';uk='В призначенні використання <%1> не обраний ""Рахунок амортизації"".'"), СтрокаТЧ.НазначениеИспользования),
					                 Отказ, Заголовок);
					СтрокаНачалаСообщенияОбОшибке = "";
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СчетАмортизацииБУНовый) Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
					                 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В новом назначении использования <%1> не выбран ""Счет амортизации"".';uk='У новому призначенні використання <%1> не обраний ""Рахунок амортизації"".'"), СтрокаТЧ.НазначениеИспользованияНовое),
					                 Отказ, Заголовок);
					СтрокаНачалаСообщенияОбОшибке = "";
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтруктураШапкиДокумента.ЕстьНДС ИЛИ СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НалоговоеНазначение) Тогда
						
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
									 + (НСтр("ru='Не заполнено ""Налоговое назначение"".';uk='Не заповнене ""Податкове призначення"".'")),
									 Отказ, Заголовок);
					СтрокаНачалаСообщенияОбОшибке = "";
					
				КонецЕсли;
				
				
			КонецЕсли;

		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры // ПроверитьНазначенияИспользования()

// Подготовливает таблицу для проведения.
//
Функция ПодготовитьТаблицуПоМалоценке(СтруктураШапкиДокумента, Отказ, Заголовок)

    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.НомерСтроки                                                                  КАК НомерСтроки,
	|	Док.ФизЛицо                                                                      КАК ФизЛицо,
	|	Док.Номенклатура                                                                 КАК Номенклатура,
	|	Док.Номенклатура.БланкСтрогогоУчета			 			                         КАК БланкСтрогогоУчета,
	|	ПРЕДСТАВЛЕНИЕ(Док.Номенклатура.БазоваяЕдиницаИзмерения)                          КАК БазоваяЕдиницаИзмерения,
	|	Док.ПартияМалоценкиВЭксплуатации                                                 КАК ПартияМалоценкиВЭксплуатации,
	|	Док.НазначениеИспользования.СчетПередачиБУ                                       КАК СчетПередачиБУ,
	|	Док.НазначениеИспользования.СчетАмортизацииБУ                                    КАК СчетАмортизацииБУ,
	|	Док.НазначениеИспользования                                                      КАК НазначениеИспользования,
	|	Док.НазначениеИспользования.Владелец                                             КАК ВладелецНазначения,
	|	Док.НалоговоеНазначение                             							 КАК НалоговоеНазначение,
	|	Док.НазначениеИспользования.СпособОтраженияРасходов                              КАК СпособОтраженияРасходов,
	|	Док.НазначениеИспользования.ВидМалоценки                                         КАК ВидМалоценки,
	|	Док.Количество* Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент 	 КАК Количество,
	|	Док.ХарактеристикаНоменклатуры                                             		 КАК ХарактеристикаНоменклатуры,
	|	Док.СерияНоменклатуры                                                      		 КАК СерияНоменклатуры,
	|	Док.НазначениеИспользованияНовое                                                 КАК НазначениеИспользованияНовое,
	|	Док.НазначениеИспользованияНовое.ВидМалоценки                                    КАК ВидМалоценкиНовый,
	|	Док.НазначениеИспользованияНовое.Владелец                                        КАК ВладелецНазначенияНового,
	|	Док.НазначениеИспользованияНовое.СчетПередачиБУ                                  КАК СчетПередачиБУНовый,
	|	Док.НазначениеИспользованияНовое.СчетАмортизацииБУ                               КАК СчетАмортизацииБУНовый,
	|	Док.НазначениеИспользованияНовое.СпособОтраженияРасходов                         КАК СпособОтраженияРасходовНовый,
	|	Док.Ссылка.ПодразделениеКому												     КАК ПодразделениеКому,
	|	Док.Ссылка.Склад						                                         КАК Склад
	|ИЗ
	|	Документ.ПеремещениеМалоценкиВЭксплуатации.МалоценныеАктивы КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СтруктураШапкиДокумента.Ссылка );
	
	ТаблицаПоМалоценке = Запрос.Выполнить().Выгрузить();
	
	ПроверитьНазначенияИспользования(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок);
	
	// Здесь бланков строгого учета быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "МалоценныеАктивы", ТаблицаПоМалоценке, Отказ, Заголовок);
	
	Возврат ТаблицаПоМалоценке;

КонецФункции 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок)

	ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента,  ТаблицаПоМалоценке, Отказ, Заголовок);
	ДвиженияПоРегиструСписаннаяМалоценкаВЭксплуатации(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок);
	
	Если Не Отказ Тогда
		УправлениеМалоценнымиАктивами.ДвижениеПартийМалоценки(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок, Ложь, ОтражатьВБухгалтерскомУчете);
	КонецЕсли;	
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Формирование движений по регистрам по управленческому учету.
//
Процедура ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;

	// Малоценка ПО РЕГИСТРУ МалоценкаВЭксплуатации.
	НаборДвижений = Движения.МалоценкаВЭксплуатации;
	
	// Проверка осатков при оперативном проведении.
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		НаборДвижений.КонтрольОстатков(ЭтотОбъект, "МалоценныеАктивы", СтруктураШапкиДокумента, Отказ, Заголовок);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//////////////////
	// Движение расход
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоМалоценке, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение,"Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	ТаблицаДвижений.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
	
 	//////////////////
	// Движение приход
	ТаблицаПоМалоценкеНовая = ТаблицаПоМалоценке.Скопировать();
	ТаблицаПоМалоценкеНовая.ЗаполнитьЗначения(СтруктураШапкиДокумента.ФизЛицоКуда, "ФизЛицо");
	
	// удаление ненужных колонок
	ТаблицаПоМалоценкеНовая.Колонки.Удалить(ТаблицаПоМалоценкеНовая.Колонки.НазначениеИспользования);
	//ТаблицаПоМалоценкеНовая.Колонки.Удалить(ТаблицаПоМалоценкеНовая.Колонки.Качество);
	
	// переименование колонок
	ТаблицаПоМалоценкеНовая.Колонки.НазначениеИспользованияНовое.Имя = "НазначениеИспользования";
	//ТаблицаПоМалоценкеНовая.Колонки.КачествоНовое.Имя                = "Качество";
	
	// добавление колонок
	ТаблицаПоМалоценкеНовая.Колонки.Добавить("ВидДвижения");
	ТаблицаПоМалоценкеНовая.Колонки.Добавить("Подразделение");
	ТаблицаПоМалоценкеНовая.ЗаполнитьЗначения(ВидДвиженияНакопления.Приход, "ВидДвижения");
	ТаблицаПоМалоценкеНовая.ЗаполнитьЗначения(Подразделение, 				"Подразделение");
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоМалоценкеНовая, ТаблицаДвижений);

	ТаблицаДвижений.ЗаполнитьЗначения( Дата  , "Период");
	ТаблицаДвижений.ЗаполнитьЗначения( Истина, "Активность");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийМалоценкиВЭксплуатации.ПеремещениеВЭксплуатации,"КодОперации");
	
	Движения.МалоценкаВЭксплуатации.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры // ДвиженияПоРегистрамУпр()

// Формирование движений по регистру СписаннаяМалоценкаВЭксплуатации.
//
Процедура ДвиженияПоРегиструСписаннаяМалоценкаВЭксплуатации(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	// Малоценка ПО РЕГИСТРУ СписаннаяМалоценкаВЭксплуатации.
	НаборДвижений = Движения.СписаннаяМалоценкаВЭксплуатации;

	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоМалоценке, ТаблицаДвижений);
	
	// Недостающие поля.
	Инд = 0;
	Для каждого Строка Из ТаблицаДвижений Цикл
		Инд = Инд+1;
		Строка.НомерСтрокиДокумента = Инд;
	КонецЦикла;
	
	ТаблицаДвижений.ЗаполнитьЗначения(Дата,   "Период");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
	ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");

	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииМалоценкиВЭксплуатации.ПеремещениеВЭксплуатации, 	"КодОперации");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ФизЛицоКуда,												"ФизЛицоКуда");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.УказыватьПартию, 											"УказыватьПартию");
	
	ЗаполнитьКолонкиРегистраСписаннаяМалоценкаВЭксплуатацииУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоМалоценке);
	ЗаполнитьКолонкиРегистраСписаннаяМалоценкаВЭксплуатацииРегл(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоМалоценке);
	
	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	Если Не Отказ Тогда
		
		Движения.СписаннаяМалоценкаВЭксплуатации.ВыполнитьДвижения();
		// необходимо записать для формирования списания партий
		Движения.СписаннаяМалоценкаВЭксплуатации.Записать();
		
		УправлениеМалоценнымиАктивами.ДвижениеПартийМалоценки(СтруктураШапкиДокумента, Движения.СписаннаяМалоценкаВЭксплуатации.Выгрузить(), Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегиструСписаннаяМалоценкаВЭксплуатации()

Процедура ЗаполнитьКолонкиРегистраСписаннаяМалоценкаВЭксплуатацииУпр(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоМалоценке)

	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		
		Возврат
		
	КонецЕсли;
	
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Подразделение    , "Подразделение");
	//ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ПодразделениеКуда, "ПодразделениеКуда");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ОтражатьВУправленческомУчете, "ОтражатьВУправленческомУчете");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	
	
КонецПроцедуры // ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамУпр()

Процедура ЗаполнитьКолонкиРегистраСписаннаяМалоценкаВЭксплуатацииРегл(ТаблицаДвижений, СтруктураШапкиДокумента, ТаблицаПоМалоценке)

	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		Возврат
		
	КонецЕсли;

	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете , "ОтражатьВБухгалтерскомУчете");
	//ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ОтражатьВНалоговомУчете     , "ОтражатьВНалоговомУчете");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация                 , "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ПодразделениеОрганизации    , "ПодразделениеОрганизации");
	//ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ПодразделениеОрганизацииКуда, "ПодразделениеОрганизацииКуда");
	
КонецПроцедуры // ЗаполнитьКолонкиРегистраСписанныеТоварыПоТоварамРегл()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Заголовок = "";
	СтруктураШапкиДокумента = ПроверкаРеквизитов(Отказ, Заголовок);

	ТаблицаПоМалоценке = ПодготовитьТаблицуПоМалоценке(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Движения по документу.
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок);
		
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры	// ОбработкаПроведения()


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры

// Процедура - обработчик события ОбработкаЗаполнения
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПередачаМалоценкиВЭксплуатацию") Тогда
		
		// Заполнение шапки
		Организация              		= Основание.Организация;
		ПодразделениеОрганизации 		= Основание.ПодразделениеОрганизации;
		Подразделение                	= Основание.Подразделение;
		ОтражатьВБухгалтерскомУчете  	= Основание.ОтражатьВБухгалтерскомУчете;
		ОтражатьВУправленческомУчете 	= Основание.ОтражатьВУправленческомУчете;
		Комментарий              		= Основание.Комментарий;
		Ответственный            		= Основание.Ответственный;
		УказыватьПартию          		= Истина;
		
		// Заполнение табличной части "МалоценныеАктивы"
		Для Каждого СтрокаТЧ Из Основание.МалоценныеАктивы Цикл
			
			НоваяСтрока = МалоценныеАктивы.Добавить();
			
			НоваяСтрока.Номенклатура                  	= СтрокаТЧ.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры 		= СтрокаТЧ.ХарактеристикаНоменклатуры;
			НоваяСтрока.СерияНоменклатуры          		= СтрокаТЧ.СерияНоменклатуры;
			
			НоваяСтрока.ЕдиницаИзмерения           		= СтрокаТЧ.ЕдиницаИзмерения;
			НоваяСтрока.Коэффициент                		= СтрокаТЧ.Коэффициент;
			НоваяСтрока.НазначениеИспользования       	= СтрокаТЧ.НазначениеИспользования;
			НоваяСтрока.ФизЛицо 				      	= СтрокаТЧ.ФизЛицо;
			НоваяСтрока.ПартияМалоценкиВЭксплуатации  	= Основание;
			НоваяСтрока.Количество                    	= СтрокаТЧ.Количество;
			НоваяСтрока.НазначениеИспользованияНовое  	= СтрокаТЧ.НазначениеИспользования;
			
			НоваяСтрока.НалоговоеНазначение       		= СтрокаТЧ.НалоговоеНазначение;
			
		КонецЦикла;
		
	//Дандали В. 15.04.2024 +
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПеремещениеМалоценкиВЭксплуатации") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание,,"Номер, дата");
		ДокументОснование 	= Основание;
		ПодразделениеКому 	= Неопределено;
		ФизЛицоКуда 		= Неопределено;
		ФилЛицоОтправителя	= Неопределено;
		СкладОтправитель	= Неопределено;
		Склад 				= Неопределено;
		
		МалоценныеАктивы.Загрузить(Основание.МалоценныеАктивы.Выгрузить());
		Для Каждого стрМалоценка из МалоценныеАктивы Цикл 		
			стрМалоценка.ФизЛицо = Основание.ФизЛицоКуда; 	
		КонецЦикла;
		Подразделение		= Основание.ПодразделениеКому;
		ФилЛицоОтправителя 	= Основание.ФизЛицоКуда;
		СкладОтправитель	= Основание.Склад;
		//МассФизЛицо = Новый Массив;
		//МассФизЛицо.Добавить(Основание.ФизЛицоКуда);
		//СоответсвтиеФизЛиц = Новый Соответствие;
		//СоответсвтиеФизЛиц.Вставить("ФизЛицо", Основание.ФизЛицоКуда);
		//Справочники.ФизическиеЛица.ЗаполнитьДанныеПоФизЛицу(МассФизЛицо, СоответсвтиеФизЛиц);
		//Подразделение = СоответсвтиеФизЛиц[Основание.ФизЛицоКуда].Подразделение;
		//ФизЛицоКуда = Основание.ФилЛицоОтправителя;
	//Дандали В. 15.04.2024 -
	
	
	//Дандали В. 31.03.2026 +
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СводныеПеремещения") Тогда
	
		ТЗМалоценка = Основание.ПолучитьОбъект().ПолучитьТоварыДляПеремещенияМалоценки();
		
		ДокументОснование              = Основание;
		Организация                    = Основание.Организация;
		Комментарий                    = Основание.Комментарий;
		ОтражатьВУправленческомУчете   = Истина;
		ОтражатьВБухгалтерскомУчете    = Ложь;
		
		Склад = Основание.СкладПолучатель;
		
		ЗаполнитьЗначенияСвойств(
		ЭтотОбъект,
		Новый Структура(
		"СкладОтправитель, СкладПолучатель, Склад",
		Основание.СкладОтправитель,
		Основание.СкладПолучатель,
		Основание.СкладПолучатель
		)
		);
		
		Если ЗначениеЗаполнено(Основание.СкладОтправитель) Тогда
			
			Если ЗначениеЗаполнено(Основание.СкладОтправитель.Подразделение) Тогда
				
				ЗаполнитьЗначенияСвойств(
				ЭтотОбъект,
				Новый Структура(
				"Подразделение, ПодразделениеПредприятия, ПодразделениеОтправитель",
				Основание.СкладОтправитель.Подразделение,
				Основание.СкладОтправитель.Подразделение,
				Основание.СкладОтправитель.Подразделение
				)
				);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Основание.СкладПолучатель) Тогда
			
			Если ЗначениеЗаполнено(Основание.СкладПолучатель.Подразделение) Тогда
				
				ЗаполнитьЗначенияСвойств(
				ЭтотОбъект,
				Новый Структура(
				"ПодразделениеПолучатель, ПодразделениеКому, ПодразделениеКуда",
				Основание.СкладПолучатель.Подразделение,
				Основание.СкладПолучатель.Подразделение,
				Основание.СкладПолучатель.Подразделение
				)
				);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ФилЛицоОтправителя = Основание.ФилЛицоОтправителя;
		ФизЛицоКуда        = Основание.ФизЛицоКуда;
		
		Для Каждого СтрМалоценка Из ТЗМалоценка Цикл
			
			НовСтр = МалоценныеАктивы.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, СтрМалоценка);
			
			Если НЕ ЗначениеЗаполнено(НовСтр.ФизЛицо) Тогда
				НовСтр.ФизЛицо = ФилЛицоОтправителя;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НовСтр.НазначениеИспользования)
				И НЕ ЗначениеЗаполнено(НовСтр.НазначениеИспользованияНовое) Тогда
				
				НовСтр.НазначениеИспользованияНовое = НовСтр.НазначениеИспользования;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ УказыватьПартию И МалоценныеАктивы.Количество() > 0 Тогда
		
		// Очистка реквизита ПартияМатериаловВЭксплуатации
		МассивОчистки = Новый Массив(МалоценныеАктивы.Количество());
		МалоценныеАктивы.ЗагрузитьКолонку(МассивОчистки, "ПартияМалоценкиВЭксплуатации");
		
	КонецЕсли;
	
	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	
	Если НЕ УчетнаяПолитика.ЕстьНДС Тогда
		
		// организация - не плательщик НДС. Установим во всех ТЧ признак соответствующего учета НДС
		НеОблНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		
		Для каждого СтрокаТЧ  Из МалоценныеАктивы Цикл
		    СтрокаТЧ.НалоговоеНазначение = НеОблНДСДеятельность;
		КонецЦикла; 
		
	КонецЕсли; 	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 
// 

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мМБП                            = Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет;
